@echo off
rem 作成日:2021/02/09
rem Ver1.03
rem ※レジストリを変更するので内容の変更・編集はしないでください※

rem ------------------------------------------------------------
color 0C
title COM固定bat ～Ver1.03～

rem ※"rem"はコメント用のコマンドです。

rem //!このコマンドは管理者権限が必要です!//
rem ------------------------------------------------------------

rem ------------------------------------------------------------
echo;
echo ＞実行することで次回接続するCOMポートを指定できます(初期設定:COM3)＜
echo;
echo ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
echo ■■■■　　～必ず管理者権限で実行してください～　　■■■■
echo ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
echo;
pause
color 0A
rem ------------------------------------------------------------

rem ------------------------------------------------------------
:loop1
rem //実行回数を表示//
set /a x=x+1
echo;
echo ＞実行回数:%x%回
echo;
rem ------------------------------------------------------------

echo ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

rem ------------------------------------------------------------
echo;
echo --------変更前--------
rem //使用中COMのデータを読み取り//
reg query "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\COM Name Arbiter" /v "ComDB"
rem ------------------------------------------------------------


rem ------------------------------------------------------------
rem //使用中COMのデータを上書き(COM2まで使用中にする)16進数//
reg add "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\COM Name Arbiter" /v "ComDB" /t "REG_BINARY" /d "0300000000000000000000000000000000000000000000000000000000000000" /f
echo;
rem ------------------------------------------------------------


rem ------------------------------------------------------------
echo --------変更後--------
rem //書き換え完了の確認//
reg query "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\COM Name Arbiter" /v "ComDB"
rem ------------------------------------------------------------

echo ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

rem ------------------------------------------------------------
rem //書き換え要求//
echo;
echo ＞もう一度書き換えますか(Y/N)?
set /p a="＞操作を自動で行う場合は"1"を入力 :"
rem ------------------------------------------------------------


rem ------------------------------------------------------------
rem //"y","Y"を入力したらループへ//
if 1==%a% (
cls
goto loop2
) else (
if y==%a% (
cls
goto loop1
) else (
if Y==%a% (
cls
goto loop1
) else (exit)
))
exit
rem ------------------------------------------------------------


rem ------------------------------------------------------------
rem ------------------------------------------------------------

rem ------------------------------------------------------------
:loop2
rem //実行回数を表示//
set /a x=x+1
echo;
echo ＞実行回数:%x%回
echo;
rem ------------------------------------------------------------

echo ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

rem ------------------------------------------------------------
echo;
echo --------変更前--------
rem //使用中COMのデータを読み取り//
reg query "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\COM Name Arbiter" /v "ComDB"
rem ------------------------------------------------------------


rem ------------------------------------------------------------
rem //使用中COMのデータを上書き(COM2まで使用中にする)16進数//
reg add "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\COM Name Arbiter" /v "ComDB" /t "REG_BINARY" /d "0300000000000000000000000000000000000000000000000000000000000000" /f
echo;
rem ------------------------------------------------------------


rem ------------------------------------------------------------
echo --------変更後--------
rem //書き換え完了の確認//
reg query "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\COM Name Arbiter" /v "ComDB"
rem ------------------------------------------------------------

echo ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

rem ------------------------------------------------------------
rem //書き換えループ//
timeout /t 10
cls
goto loop2
rem ------------------------------------------------------------


rem ------------------------------------------------------------
rem //抜けた用//
echo ※不正な操作です※
timeout /t 2

exit
rem ------------------------------------------------------------
